bugs fixes, docs updated
